arabic = {'\\x01': 1, '\\x02': 2,'\\x03': 3, '\\x04': 4, '\\x05': 5, '\\x06': 6, '\\x07': 7, '\\x08': 8,
          '\\t': 9, '\\n': 10, '\\x0b': 11, '\\x0c': 12, '\\x0d': 13, '\\r': 13, '\\x0e': 14, '\\x0f': 15, '\\x10': 16,
          '\\x11': 17, '\\x12': 18, '\\x13': 19, '\\x14': 20, '\\x15': 21, '\\x16': 22, '\\x17': 23, '\\x18': 24,
          '\\x19': 25, '\\x1a': 26, '\\x1b': 27, '\\x1c': 28, '\\x1d': 29, '\\x1e': 30, ' ': 32, '!': 33, '"': 34,
          '#': 35, '$': 36, '%': 37, '^': 38, '&': 39, ',': 44, '.': 46, '0': 48, '<': 60
          }


cyrillic = {
        '0\\x04': 'а', '1\\x04': 'б', '2\\x04': 'в', '3\\x04': 'г', '4\\x04': 'д', '5\\x04': 'е', 'Q\\x04': 'ё',
        '6\\x04': 'ж', '7\\x04': 'з', '8\\x04': 'и', 'V\x04': 'и', '9\\x04': 'й', ':\\x04': 'к', ';\\x04': 'л', '<\\x04': 'м',
        '=\\x04': 'н', '>\\x04': 'о', '?\\x04': 'п', '@\\x04': 'р', 'A\\x04': 'с', 'B\\x04': 'т', 'C\\x04': 'у',
        'D\\x04': 'ф', 'E\\x04': 'х', 'F\\x04': 'ц', 'G\\x04': 'ч', 'H\\x04': 'ш', 'I\\x04': 'щ', 'J\\x04': 'ъ',
        'K\\x04': 'ы', 'L\\x04': 'ь', 'M\\x04': 'э', 'N\\x04': 'ю', 'O\\x04': 'я',
        '\\x10\\x04': 'А', '\\x11\\x04': 'Б', '\\x12\\x04': 'В', '\\x13\\x04': 'Г', '\\x14\\x04': 'Д',
        '\\x15\\x04': 'Е', '\\x01\\x04': 'Ё', '\\x16\\x04': 'Ж', '\\x17\\x04': 'З', '\\x18\\x04': 'И',
        '\\x19\\x04': "Й", '\\x1a\\x04': 'К', '\\x1b\\x04': 'Л', '\\x1c\\x04': 'М', '\\x1d\\x04': 'Н',
        '\\x1e\\x04': 'О', '\\x1f\\x04': 'П', ' \\x04': 'Р', '!\\x04': 'С', '"\\x04': 'Т',
        '#\\x04': 'У', '$\\x04': 'Ф', '%\\x04': 'Х', '&\\x04': 'Ц', "\\'\\x04": 'Ч', '(\\x04': 'Ш',
        ')\\x04': 'Щ', '*\\x04': 'Ъ', '+\\x04': 'Ы', ',\\x04': 'Ь', '-\\x04': 'Э', '.\\x04': 'Ю', '/\\x04': 'Я',
    }

items = {
    '\\x048\\x18': "[Усиленный свиток стойкости]", '\\x04\\xb63': "[Зелье Арлекина]", '\\x04\\xd4W': "[Живительный Пунш]",
    '\\x04\\x950': "[Эликсир выносливости искателя]", '\\x04\\xe9\\x11': "[Свиток телепортации]",
    '\\x04\\xa33': "[Великий эликсир гладиатора]", '\\x04\\x8e\\x10': "[Свиток ремонта]", '\\x04&\\x18': "[Великое зелье жизни]",
    '\\x04!-': "[Свиток жизни]", '\\x04\\xfd\\x15': "[Билет на арену]", '\\x047T': "[Свиток отваги]", '\\x04\\xd9d': "[Кислородный баллон]",
    '\\x04\\xa53': "[Великий эликсир единства]", '\\x04Ng': "[Эликсир репутации тритонов]", '\\x04\\x99\\x99': "[Эликсир репутации старейшин]",
    '\\x04Yg': "[Копчёный марлин]", '\\x04dg': "[Крепкий ром]", '\\x04Qg': "[Свиток подводного ускорения]",
    '\\x04\\x9b0': "[Призыв Чумного знахаря]", '\\x04[n': "[Призыв Белой Крысы]"
}